TestCases/FlowBoiling/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField       uniform 0;

boundaryField
{
    "(Walls|Base)"
    
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    
    Top
    {
        type            totalPressure;
        p0              uniform 0;
    }

    FrontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
